# InvalidStartLevelRamp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..InvalidStartLevelRamp Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The start level and end level for this ramp must be at different elevations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidStartLevelRamp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidStartLevelRamp As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidStartLevelRamp {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace